packages/foamlib/foamlib-1.1.1.tar.gz/foamlib-1.1.1/tests/test_preprocessing/templates/damBreak/system/setFieldsDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  plus                                  |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      setFieldsDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

#include "<system>/simulationParameters"

defaultFieldValues
(
    volScalarFieldValue alpha.water 0
    volScalarFieldValue T 350
);

regions
(
    boxToCell
    {
        box (0 0 -1) (0.1461 $fluidHeight 1);
        fieldValues
        (
            volScalarFieldValue alpha.water 1
            volScalarFieldValue T 273
        );
    }
);


// ************************************************************************* //
